<?php
date_default_timezone_set('Asia/Shanghai');
/**
  **********------------------------------------------------------------------------------**********
  ****** 官方网站：http://bbs.52codes.net  ********
  **************************************************************************************************
*/
/**************************   网站基本设置   **************************/

$FromName = '莎莎源码在线支付';  // 网站名称
$allow_sep = '30';  // 30秒内不能重复提交订单，防恶意刷单
$sepmsg = '对不起！您已经提交过，不要重复提交，请等待'.$allow_sep .'秒后再试！';  // 重复提交后弹出的提示语

/**************************   订单发送设置 发件箱必须开通pop3服务   **************************/

$MailFrom = 'cs@100865.vip';  // 设置一个用来发送订单信息的邮箱，需开启SMTP服务
$Mailhost = 'smtp.163.com';  // 邮箱SMTP服务器地址 【163邮箱（smtp.163.com）、qq邮箱（smtp.qq.com）】
$MailUsername = 'cs@100865.vip';  // 邮箱登陆帐号 【如果是163邮箱需填写整个邮箱地址，如果是qq邮箱只需填写qq号】
$MailPassword = '123456';  // 邮箱登陆密码【如果必须开启客户端授权密码才能开启163邮箱的POP3服务的话，则需要将此密码改为客户端授权密码】


/**************************   订单接收设置   **************************/

$MailTo = '151619143@qq.com';  // 设置接收订单信息的邮箱 【注意：不能与上面设置的发送订单信息的邮箱相同】
$MailTob = '18312345678@139.com';  // 设置接收订单信息的邮箱 【设置一个手机号(QQ号)邮箱即可实现手机短信接收订单信息】
///////////////////////////////////////// 两种支付宝付款方式选择设置 /////////////////////////////////////////
$zfbwkfs='skm';//设置支付宝付款方式，skm为收款码付款，sh为商户接口付款

///////////////////////// 支付宝收款码收款设置 /////////////////////////

$bdzhifubao = 'vip1zw@163.com';  // 支付宝收款的支付宝账户，使用支付宝商户也请在此设置哦

///////////////////////////////////////// 支付宝商户接口 /////////////////////////////////////////
$alipayzk = '1';  // 支付宝付款折扣（如：0.8 即为8折，设为1不打折）

$alipaytype = '02';  // 支付收款接口类型（01为即时到帐，02为担保交易，03为双功能）

$alipay_config['partner'] = '2088001234567890';  // 合作身份者PID（以2088开头的16位纯数字）

$alipay_config['key'] = 'aa123456789bb123456789cc12345678';  // 安全检验码KEY（以数字和字母组成的32位字符）

$seller_email = 'abc@163.com';  // 签约支付宝账号或卖家支付宝帐户

$alipay_config['sign_type']    = strtoupper('MD5');

$alipay_config['input_charset']= strtolower('gbk');

$alipay_config['cacert']    = getcwd().'\\cacert.pem';

$alipay_config['transport']    = 'http';

////////////////////// 微信扫码付款设置///////////////////////////
$wxh = 'yyv8top';  // 设置一个用于微信支付收款用的微信号,需实名认证及绑定银行卡


///////////////////////////////////////// 订单伪数据库设置 /////////////////////////////////////////
$clwrite='on'; // 设置是否开启邮件发送失败数据写入功能（on=开启 off=关闭）
$cldatadir='data/cldata.php'; // 设置保存订单数据的文件路径，支持个性化修改，修改后记得将订单系统文件夹下对应的文件夹名和文件名作相应修改，否则无法正确写入

$cldata="┆ 下单时间：".date("Y-m-d H:i:s")."\r\n"."┆ 产品:".$_POST['bdproduct']."\r\n"."┆ 产品型号:".$_POST['bdproductb']."\r\n"."┆ 数量：".$_POST['bdmun']."\r\n"."┆ 姓名（会员名）（会员名）：".$_POST['bdname']."\r\n"."┆ 手机：".$_POST['bdmob']."\r\n"."┆ 地址：".$_POST['bdprovince'].$_POST['bdcity'].$_POST['bdarea'].$_POST['bdaddress']."\r\n"."┆ 留言备注:".$_POST['bdguest']."\r\n"."┆ 来路页面：".$_POST['referer']."\r\n"."┆ 下单页面：".$_POST['purl']."\r\n"."┆ 下单IP：".$_SERVER['REMOTE_ADDR']." \r\n\r\n"; // 设置订单数据保存格式，对PHP代码不熟悉的话不建议修改这段
?>
