<?php
ini_set('default_charset', 'gb2312');
exit("<script>alert('禁止访问！');</script>");
/**
  **************************************************************************************************
  **********  莎莎源码 2016 WAP版官方正式版  *****  官方正版 *** 版权所有 *** 盗版必究  **********
  **********------------------------------------------------------------------------------**********
  ****** 官方网站：http://bbs.sasadown.cn/  *****  莎莎源码 ********
  **************************************************************************************************
  **********------------------------------------------------------------------------------**********
  **********  莎莎源码 2016 WAP版官方正式版完全开源无任何加密 杜绝倒卖 鄙视加密捣卖者   **********
  **************************************************************************************************

            
       注意：
              1、只有邮件发送失败的订单信息才会写入此文件，linux空间此文件要有777写入权限。
2、此文件可以改名，但是相应的在bdconfig.php文件里同时也要改过来。
3、此文件头部代码不可删除，作用是禁止别人从浏览器访问此文件。
  */
?>
 


┆ 下单时间：2016-07-14 09:31:11
┆ 产品:月VIP组 30元,
┆ 产品型号:
┆ 数量：1
┆ 姓名（会员名）（会员名）：黑锐
┆ 手机：18989898989
┆ 地址：
┆ 留言备注:123
┆ 来路页面：http://test.heirui.cn/
┆ 下单页面：http://test.heirui.cn/pay/template/index.html
┆ 下单IP：127.0.0.1 

┆ 下单时间：2016-07-14 17:30:43
┆ 产品:月VIP组 30元,季度VIP组 50元,
┆ 产品型号:
┆ 数量：2
┆ 姓名（会员名）（会员名）：莎莎源码
┆ 手机：1091098809
┆ 地址：
┆ 留言备注:
┆ 来路页面：http://127.0.0.1/
┆ 下单页面：http://127.0.0.1/template/
┆ 下单IP：127.0.0.1 

